#Область ОбработчикиСобытий
	
Функция querypost(Запрос)
	
	// Создаем структуру ответа, которая состоит из статуса и ответа
	СтруктураОтвета = Новый Структура("status, response");
	
	ТекстЗапроса = Запрос.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
	
	// Выполняем запрос
	Попытка
		СтруктураОтвета.response = ВыполнитьЗапрос(ТекстЗапроса);
	Исключение
		Ответ = ПодготовитьОтвет(403, "Ошибка во время выполнения запроса", Истина);
		Возврат Ответ;
	КонецПопытки;
	
	// Переводим в JSON
	Попытка
		СтруктураОтвета.status = "ОК";
		ТекстОтвета = СформироватьJSON(СтруктураОтвета);
	Исключение
		Ответ = ПодготовитьОтвет(403, "Ошибка во время формирования JSON", Истина);
		Возврат Ответ;
	КонецПопытки;
	
	Ответ = ПодготовитьОтвет(200, ТекстОтвета, Ложь);
	
	Возврат Ответ;
КонецФункции

#КонецОбласти 
#Область ВспомогательныеФункции
	
Функция СформироватьJSON(Данные)
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, Символы.Таб));
	
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON( , Символы.Таб);
	
	НастройкиСериализацииJSON = Новый НастройкиСериализацииJSON;
	НастройкиСериализацииJSON.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.ЛокальнаяДата;
	НастройкиСериализацииJSON.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
	
	ЗаписатьJSON(ЗаписьJSON, Данные, НастройкиСериализацииJSON);
	
	Возврат ЗаписьJSON.Закрыть();
КонецФункции

Функция ПодготовитьОтвет(КодОтвета, СтруктураОтвета, Ошибка)
	Ответ = Новый HTTPСервисОтвет(КодОтвета);
	Если Ошибка Тогда
		Ответ.Заголовки.Вставить("Content-Type", "text/html;charset=utf-8");
		Ответ.УстановитьТелоИзСтроки(СтруктураОтвета, КодировкаТекста.UTF8);
	Иначе
		Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
		Ответ.УстановитьТелоИзСтроки(СтруктураОтвета, КодировкаТекста.UTF8);
	КонецЕсли;
	Возврат Ответ;
КонецФункции

Функция ВыполнитьЗапрос(ТекстЗапроса)
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	Результат = Запрос.Выполнить().Выгрузить();
		
	Возврат Результат;
	
КонецФункции

#КонецОбласти
